backend/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
    def index
        tasks = Task.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2023-01-22 22:06:10.597308"], ["id", 1]]
---
        task = Task.find(params[:id])
        task.update!(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
        task = Task.find(params[:id])
        task.destroy

INSERT INTO "tasks" ("title", "due_date", "completed", "priority", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["due_date", "2023-01-03"], ["completed", false], ["priority", "low"], ["created_at", "2023-01-22 21:52:44.567952"], ["updated_at", "2023-01-22 21:52:44.567952"]]
---
        task = Task.create!(task_params)